Revit 2024 API
RevitEventArgs Class
 The class is used as base class for all event argument classes.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class RevitEventArgs : EventArgs
Visual Basic
Public Class RevitEventArgs _
	Inherits EventArgs
Visual C++
public ref class RevitEventArgs : public EventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.DB.Events.PostEventArgs
 Autodesk.Revit.DB.Events.PreEventArgs
 Autodesk.Revit.UI.Events.CommandEventArgs
See Also
RevitEventArgs Members
Autodesk.Revit.DB.Events Namespace